bench/reproducible/results/resource-20260524Tphase6-no-pprof-build-rerun/raw/kruda-throughput-json-static-wrk.txt
Running 15s test @ http://127.0.0.1:3300/json-static
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   237.50us  279.22us  13.44ms   95.24%
    Req/Sec   207.60k    43.25k  257.44k    77.00%
  Latency Distribution
     50%  203.00us
     75%  260.00us
     90%  431.00us
     99%    1.07ms
  12389174 requests in 15.02s, 1.73GB read
Requests/sec: 825018.49
Transfer/sec:    118.02MB